src/main/resources/cdm-sample-files/dtcc-11-0/DDL_NewTrade6.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/  ../../schemas/dtcc-11-0/soap-envelope.xsd"
        xmlns:fpml="http://www.fpml.org/2010/FpML-4-9"  xmlns:rm="OTC_RM_11-0"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:mtc="OTC_Matching_11-0">
    <env:Header>
        <OTC_RM
            xmlns="OTC_RM_11-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <Status>Confirmed</Status>
                    <TransType>Trade</TransType>
                    <ProductType>CreditDefaultSwapShort</ProductType>
                    <Submitter>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00005678"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">105424OCT1KP_CP</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181026.0007196855</fpml:tradeId>
                        </partyTradeIdentifier>
                    </Submitter>
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00001234"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">1054_26OCT1</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181026.0007196855</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                    <USI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">9J6AQFWC2C</USIIssuer>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">TRADESERV20181026560757688K9W667</USITradeId>
                    </USI>
                    <OriginatingUSI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier"/>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier"/>
                    </OriginatingUSI>
                </TradeMsg>
                <MsgId>MSERV20181026.0007196855</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <From>MarkitSERV</From>
                    <To>DTCC</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.markitserv.net</RouteAddress>
                        <ReceiveTime>2018-10-26T09:32:15.288-04:00</ReceiveTime>
                        <ReleaseTime>2018-10-26T09:33:14.612-04:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <OTC_Matching
            xmlns="OTC_Matching_11-0">
            <Activity>New</Activity>
            <Status>Confirmed</Status>
            <WarehouseState>
                <WarehouseStatus>Submit</WarehouseStatus>
                <WarehousePositionType>Gold</WarehousePositionType>
            </WarehouseState>
            <Trade>
                <FpML version="4-9" xmlns="http://www.fpml.org/2010/FpML-4-9"
                      xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xsi:schemaLocation="http://www.fpml.org/2010/FpML-4-9 ../../schemas/fpml-4-9/fpml-main-4-9.xsd
					   http://www.w3.org/2000/09/xmldsig# ../../schemas/fpml-4-9/xmldsig-core-schema.xsd"
                      xsi:type="RequestTradeConfirmation">
                    <header>
                        <messageId messageIdScheme="perFpMLReqmt">MSERV20181026.0007196855</messageId>
                        <sentBy>DTCC00005678</sentBy>
                        <sendTo>DTCC00001234</sendTo>
                        <creationTimestamp>2018-10-26T13:33:14.616Z</creationTimestamp>
                    </header>
                    <trade>
                        <tradeHeader
                            xmlns="http://www.fpml.org/2010/FpML-4-9">
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00005678"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">105424OCT1KP_CP</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181026.0007196855</fpml:tradeId>
                            </partyTradeIdentifier>
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00001234"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">1054_26OCT1</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181026.0007196855</fpml:tradeId>
                            </partyTradeIdentifier>
                            <tradeDate>2017-11-15</tradeDate>
                        </tradeHeader>
                        <creditDefaultSwap>
                            <generalTerms>
                                <effectiveDate>
                                    <fpml:unadjustedDate>2017-11-16</fpml:unadjustedDate>
                                    <fpml:dateAdjustments>
                                        <fpml:businessDayConvention>NotApplicable</fpml:businessDayConvention>
                                    </fpml:dateAdjustments>
                                </effectiveDate>
                                <scheduledTerminationDate>
                                    <fpml:adjustableDate>
                                        <fpml:unadjustedDate>2020-03-20</fpml:unadjustedDate>
                                        <fpml:dateAdjustments>
                                            <businessDayConvention>NotApplicable</businessDayConvention>
                                        </fpml:dateAdjustments>
                                    </fpml:adjustableDate>
                                </scheduledTerminationDate>
                                <sellerPartyReference href="DTCC00005678"/>
                                <buyerPartyReference href="DTCC00001234"/>
                                <referenceInformation>
                                    <fpml:referenceEntity>
                                        <fpml:entityName entityNameScheme="http://www.fpml.org/spec/2003/entity-name-RED">LEXMARK INTERNATIONAL, INC.</fpml:entityName>
                                        <fpml:entityId entityIdScheme="http://www.fpml.org/spec/2003/entity-id-RED">57BGE9AD0</fpml:entityId>
                                    </fpml:referenceEntity>
                                    <referenceObligation>
                                        <bond>
                                            <instrumentId instrumentIdScheme="http://www.fpml.org/spec/2002/instrument-id-ISIN">US529772AF23</instrumentId>
                                        </bond>
                                    </referenceObligation>
                                </referenceInformation>
                            </generalTerms>
                            <feeLeg>
                                <singlePayment>
                                    <adjustablePaymentDate>2017-11-20</adjustablePaymentDate>
                                    <fixedAmount>
                                        <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                        <amount>3456.00000</amount>
                                    </fixedAmount>
                                </singlePayment>
                                <periodicPayment>
                                    <paymentFrequency>
                                        <periodMultiplier>3</periodMultiplier>
                                        <period>M</period>
                                    </paymentFrequency>
                                    <firstPeriodStartDate>2017-09-20</firstPeriodStartDate>
                                    <firstPaymentDate>2017-12-20</firstPaymentDate>
                                    <rollConvention>20</rollConvention>
                                    <fixedAmountCalculation>
                                        <fixedRate>0.0100000000</fixedRate>
                                    </fixedAmountCalculation>
                                </periodicPayment>
                            </feeLeg>
                            <protectionTerms>
                                <calculationAmount id="calculationAmount">
                                    <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                    <amount>1000000.00000</amount>
                                </calculationAmount>
                                <creditEvents>
                                    <restructuring/>
                                </creditEvents>
                            </protectionTerms>
                        </creditDefaultSwap>
                        <calculationAgent>
                            <calculationAgentParty>AsSpecifiedInMasterAgreement</calculationAgentParty>
                        </calculationAgent>
                        <calculationAgentBusinessCenter businessCenterScheme="http://www.fpml.org/spec/2000/business-center">USNY</calculationAgentBusinessCenter>
                        <documentation>
                            <masterAgreement>
                                <masterAgreementType masterAgreementTypeScheme="http://dtcc.com/coding-scheme/master-agreement-type">ISDA</masterAgreementType>
                                <masterAgreementVersion masterAgreementVersionScheme="http://www.fpml.org/coding-scheme/master-agreement-version">2002</masterAgreementVersion>
                                <masterAgreementDate>2016-01-15</masterAgreementDate>
                            </masterAgreement>
                            <contractualDefinitions contractualDefinitionsScheme="http://www.fpml.org/coding-scheme/contractual-definitions">ISDA2014Credit</contractualDefinitions>
                            <contractualMatrix>
                                <matrixType matrixTypeScheme="http://www.fpml.org/coding-scheme/matrix-type">CreditDerivativesPhysicalSettlementMatrix</matrixType>
                                <publicationDate>2016-01-15</publicationDate>
                                <matrixTerm matrixTermScheme="http://www.fpml.org/coding-scheme/credit-matrix-transaction-type">StandardNorthAmericanCorporate</matrixTerm>
                            </contractualMatrix>
                        </documentation>
                    </trade>
                    <party id="DTCC00005678">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00005678</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCC549300FSLUWD8ETI2P24</fpml:partyId>
                    </party>
                    <party id="DTCC00001234">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00001234</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCC549300J6MD8PFY96XF36</fpml:partyId>
                    </party>
                </FpML>
            </Trade>
            <WorkflowData>
                <partyReference href="DTCC00005678"/>
                <PartyWorkflowFields>
                    <comment>Comment text</comment>
                    <superId>ABC_PrechangedValue</superId>
                    <deskId>08-671</deskId>
                    <eTradeId>Trade-XYZ</eTradeId>
                    <designatedParty>ABC Clearing</designatedParty>
                    <brokerName>IDB Broker</brokerName>
                    <branchLocation>London</branchLocation>
                    <midMarketPrice>
                        <midMarketPriceType>Price</midMarketPriceType>
                        <amount>129.0000000000</amount>
                    </midMarketPrice>
                </PartyWorkflowFields>
            </WorkflowData>
            <WorkflowData>
                <partyReference href="DTCC00001234"/>
                <PartyWorkflowFields>
                    <comment>Comment text</comment>
                    <superId>ABC_PrechangedValue</superId>
                    <deskId>08-671</deskId>
                    <eTradeId>Trade-XYZ</eTradeId>
                    <designatedParty>ABC Clearing</designatedParty>
                    <brokerName>IDB Broker</brokerName>
                    <branchLocation>London</branchLocation>
                    <midMarketPrice>
                        <midMarketPriceType>Price</midMarketPriceType>
                        <amount>129.0000000000</amount>
                    </midMarketPrice>
                </PartyWorkflowFields>
            </WorkflowData>
        </OTC_Matching>
    </env:Body>
</env:Envelope>